Revit 2026 API

# CableSize Class

---

This class represents the definition of Cable Size data.

SystemObject Autodesk.Revit.DB.ElectricalCableSize

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CableSize : IDisposable
```
```vb
Public Class CableSize
	Implements IDisposable
```
```cpp
public ref class CableSize : IDisposable
```
```fsharp
type CableSize =
    class
        interface IDisposable
    end
```

The CableSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Comments | The comments of this Cable Size. |
|  | GroundConductorSize | The size of a Ground Conductor. |
|  | HotConductorSize | The size of a Hot Conductor. |
|  | Id | The Cable Size id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of this Cable Size. |
|  | NeutralConductorSize | The size of a Neutral Conductor. |
|  | NumberOfGroundConductors | The number of Ground Conductors. |
|  | NumberOfHotConductors | The number of Hot Conductors. |
|  | NumberOfNeutralConductors | The number of Neutral Conductors. |
|  | NumberOfOtherConductors | The number of Other Conductors. |
|  | OtherConductorSize | The size of an Other Conductor. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Cable Size. |
|  | Dispose | Releases all resources used by the CableSize |
|  | Duplicate | Duplicates this Cable Size. |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCableSize | Gets the Cable Size data by given Cable Size id. |
|  | GetCableSizeIdByName | Gets the Cable Size id by given Cable Size name. |
|  | GetCableSizeIds | Gets all the Cable Size ids in the given document, sorted by name. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace